dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <WebSocketsClient.h>
#include <ArduinoJson.h>
#include <Wire.h>
#include <U8g2lib.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <Adafruit_NeoPixel.h>
#include <driver/ledc.h>
#include <WiFiUdp.h>
#include <NTPClient.h>
#include <time.h>
#include <string.h>
#include <esp_idf_version.h>
const char* WIFI_SSID     = "ssid";
const char* WIFI_PASSWORD = "password";
const char* BOT_TOKEN     = "bot token";
const char* WEATHER_API_KEY = "WEATHER_API_KEY";
const char* NASA_API_KEY    = "NASA_API_KEY";
const char* DEEPSEEK_API_KEY = "DEEPSEEK_API_KEY";
#define BOT_GUILD_ID "GUILD_ID"
const char* OWNER_ID_STR        = "OWNER_ID_STR";
const char* TARGET_CHANNEL_ID  = "TARGET_CHANNEL_ID";
const char* TARGET_CHANNEL_ID1 = "TARGET_CHANNEL_ID1";
const int DISCORD_CONTENT_MAX = 2000;
const int DEEPSEEK_MAX_TOKENS = 900;
const size_t DEEPSEEK_JSON_DOC = 12288;
const int RGB_LED_PIN = 48;
const int PIN_SERVO   = 47;
const int PIN_SET1    = 6;
const int PIN_SET2    = 7;
const int PIN_DS18B20 = 10;
const int PIN_I2C_SDA = 8;
const int PIN_I2C_SCL = 9;
const int PIN_TOUCH   = 4;
const uint32_t TOUCH_THRESHOLD = 2000;
const int PIN_USB_VBUS_ADC = 1;
const uint32_t USB_VBUS_R_HI = 10000;
const uint32_t USB_VBUS_R_LO = 10000;
const uint8_t TOUCH_AVG_N = 16;
const unsigned long USB_VBUS_READ_MS = 500;
WiFiUDP ntpUDP;
const long PST_OFFSET_SEC = -28800;
const long PDT_OFFSET_SEC = -25200;
NTPClient timeClient(ntpUDP, "pool.ntp.org", 0, 60000);
int civilDayOfWeek(int year, int month, int day) {
  static const int t[] = {0, 3, 2, 5, 0, 3, 5, 1, 4, 6, 2, 4};
  int y = year;
  if (month < 3) y--;
  return (y + y / 4 - y / 100 + y / 400 + t[month - 1] + day) % 7;
}
int nthSundayOfMonth(int year, int month, int nth) {
  int dow1 = civilDayOfWeek(year, month, 1);
  int firstSunday = 1 + ((7 - dow1) % 7);
  return firstSunday + (nth - 1) * 7;
}
bool isPacificDaylightTime(unsigned long utcEpoch) {
  time_t t = (time_t)utcEpoch;
  struct tm tmUtc;
  gmtime_r(&t, &tmUtc);
  int year = tmUtc.tm_year + 1900;
  int month = tmUtc.tm_mon + 1;
  int day = tmUtc.tm_mday;
  int hour = tmUtc.tm_hour;
  if (month < 3 || month > 11) return false;
  if (month > 3 && month < 11) return true;
  if (month == 3) {
    int startDay = nthSundayOfMonth(year, 3, 2);
    if (day < startDay) return false;
    if (day > startDay) return true;
    return hour >= 10;
  }
  int endDay = nthSundayOfMonth(year, 11, 1);
  if (day < endDay) return true;
  if (day > endDay) return false;
  return hour < 9;
}
void updateLocalTime() {
  timeClient.setTimeOffset(0);
  timeClient.update();
  unsigned long utc = timeClient.getEpochTime();
  timeClient.setTimeOffset(isPacificDaylightTime(utc) ? PDT_OFFSET_SEC : PST_OFFSET_SEC);
}
const unsigned long SYSINFO_INTERVAL_MS = 14400000UL;
unsigned long lastSysInfoMillis = 0;
int lastSentHour = -1;
WebSocketsClient gatewayWS;
WiFiClientSecure httpsClient;
DynamicJsonDocument* gwDoc = nullptr;
const size_t GW_DOC_PSRAM = 262144;
const uint32_t BOARD_PSRAM_BYTES = 8UL * 1024UL * 1024UL;
bool gatewayConnected     = false;
bool identified           = false;
int  heartbeatIntervalMs   = 0;
unsigned long lastHeartbeatMillis = 0;
int lastSeq               = 0;
unsigned long lastBotActivityMillis = 0;
const unsigned long BOT_PRESENCE_IDLE_MS = 300000UL;
uint8_t botDiscordStatus = 0;
const uint32_t CPU_MHZ_ACTIVE = 240;
const uint32_t CPU_MHZ_OLED_OFF_BOT_IDLE = 80;
void noteBotActivity();
void updateBotPresenceIdle();
void sendBotPresence(const char* status, bool afk);
U8G2_SSD1327_WS_128X128_F_HW_I2C u8g2(U8G2_R0,  U8X8_PIN_NONE);
void noteDisplayActivity();
void drawDashboard();
float dashTempC = -999.0f;
float dashTempF = -999.0f;
int lastServoDeg = 45;
struct TrackedUser {
  String userId, userName;
  uint8_t status;
  uint32_t useCount24h;
  bool active;
};
static const uint8_t MAX_TRACKED_USERS = 8;
TrackedUser trackedUsers[MAX_TRACKED_USERS];
String cachedGuildIds[3];
uint8_t cachedGuildCount = 0;
unsigned long usesWindowStartMillis = 0;
const unsigned long USES_WINDOW_MS = 86400000UL;
uint8_t statusFromDiscord(const char* s) {
  if (!s) return 0;
  if (!strcmp(s, "online")) return 2;
  if (!strcmp(s, "idle")) return 1;
  if (!strcmp(s, "dnd")) return 3;
  return 0;
}
const char* statusToWord(uint8_t s) {
  static const char* w[] = {"Off", "Idle", "On", "DND"};
  return s < 4 ? w[s] : "Off";
}
void clearTrackedSlot(uint8_t i) {
  trackedUsers[i].active = false;
  trackedUsers[i].userId = "";
  trackedUsers[i].userName = "";
  trackedUsers[i].status = 0;
  trackedUsers[i].useCount24h = 0;
}
void fillTrackedSlot(uint8_t i, const String& userId, const String& userName) {
  trackedUsers[i].active = true;
  trackedUsers[i].userId = userId;
  trackedUsers[i].userName = userName;
  trackedUsers[i].status = 0;
  trackedUsers[i].useCount24h = 0;
}
void initTrackedUsers() {
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) clearTrackedSlot(i);
}
void resetUseWindowIfNeeded() {
  unsigned long now = millis();
  if (usesWindowStartMillis == 0) {
    usesWindowStartMillis = now;
    return;
  }
  if (now - usesWindowStartMillis >= USES_WINDOW_MS) {
    usesWindowStartMillis = now;
    for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
      trackedUsers[i].useCount24h = 0;
    }
  }
}
int findUserIndex(const String& userId) {
  if (userId.length() == 0) return -1;
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (trackedUsers[i].active && trackedUsers[i].userId == userId) return (int)i;
  }
  return -1;
}
int findFreeTrackedSlot() {
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (!trackedUsers[i].active) return (int)i;
  }
  return -1;
}
int addOrPickUserSlot(const String& userId, const String& userName) {
  int idx = findUserIndex(userId);
  if (idx >= 0) {
    if (userName.length()) trackedUsers[idx].userName = userName;
    return idx;
  }
  idx = findFreeTrackedSlot();
  if (idx >= 0) {
    fillTrackedSlot((uint8_t)idx, userId, userName);
    return idx;
  }
  uint8_t worst = 0;
  for (uint8_t i = 1; i < MAX_TRACKED_USERS; i++) {
    if (trackedUsers[i].useCount24h < trackedUsers[worst].useCount24h) worst = i;
  }
  fillTrackedSlot(worst, userId, userName);
  return (int)worst;
}
void recordUserUse(const String& userId, const String& userName) {
  resetUseWindowIfNeeded();
  if (userId.length() == 0) return;
  int idx = findUserIndex(userId);
  if (idx < 0) {
    idx = addOrPickUserSlot(userId, userName);
  }
  if (idx < 0) return;
  if (userName.length()) trackedUsers[idx].userName = userName;
  trackedUsers[idx].status = 2;
  trackedUsers[idx].useCount24h++;
  noteDisplayActivity();
}
void applyPresencesArray(JsonArray presences) {
  if (presences.isNull()) return;
  for (JsonObject p : presences) {
    const char* uid = p["user"]["id"];
    if (!uid) continue;
    int idx = findUserIndex(String(uid));
    if (idx < 0) continue;
    const char* st = p["status"] | "offline";
    trackedUsers[idx].status = statusFromDiscord(st);
  }
}
void gwSendJson(JsonDocument& doc) {
  String payload;
  serializeJson(doc, payload);
  gatewayWS.sendTXT(payload);
}
void requestTrackedUserPresences() {
  if (cachedGuildCount == 0) return;
  bool any = false;
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (trackedUsers[i].active && trackedUsers[i].userId.length()) {
      any = true;
      break;
    }
  }
  if (!any) return;
  for (uint8_t g = 0; g < cachedGuildCount; g++) {
    if (cachedGuildIds[g].length() < 16) continue;
    StaticJsonDocument<768> doc;
    doc["op"] = 8;
    JsonObject d = doc.createNestedObject("d");
    d["guild_id"] = cachedGuildIds[g];
    d["limit"] = 0;
    d["presences"] = true;
    JsonArray ids = d.createNestedArray("user_ids");
    for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
      if (trackedUsers[i].active && trackedUsers[i].userId.length()) {
        ids.add(trackedUsers[i].userId);
      }
    }
    gwSendJson(doc);
  }
}
String discordDisplayName(JsonVariantConst user) {
  String name = user["global_name"] | "";
  if (name.length() == 0) name = user["username"] | "";
  return name;
}
void handlePresenceUpdate(JsonObject d) {
  const char* uid = d["user"]["id"];
  const char* st  = d["status"] | "offline";
  if (!uid) return;
  String name = discordDisplayName(d["user"]);
  int idx = findUserIndex(String(uid));
  if (idx < 0) {
    idx = addOrPickUserSlot(String(uid), name);
    if (idx < 0) return;
  }
  if (name.length()) trackedUsers[idx].userName = name;
  trackedUsers[idx].status = statusFromDiscord(st);
}
String transientLine1 = "";
String transientLine2 = "";
String transientLine3 = "";
unsigned long transientUntilMs = 0;
unsigned long lastDashMillis = 0;
const unsigned long DASH_REFRESH_MS = 2000;
unsigned long lastDisplayActivityMillis = 0;
unsigned long lastTouchWakeMillis = 0;
bool touchWasActive = false;
uint32_t touchIdleBuf[TOUCH_AVG_N];
uint8_t touchIdleBufCount = 0;
uint8_t touchIdleBufIdx = 0;
uint32_t touchIdleSum = 0;
uint32_t touchIdleAvg = 0;
uint32_t usbVbusRefMv = 0;
uint32_t usbVbusMvCached = 0;
uint32_t usbVbusCompLastMv = 0;
unsigned long usbVbusLastReadMs = 0;
bool displayAsleep = false;
const unsigned long DISPLAY_IDLE_MS = 60000UL;
const unsigned long DISPLAY_DIM_MS = 15000UL;
const unsigned long TOUCH_DEBOUNCE_MS = 300;
const uint8_t DISPLAY_CONTRAST_FULL = 255;
OneWire oneWire(PIN_DS18B20);
DallasTemperature sensors(&oneWire);
Adafruit_NeoPixel pixels(1, RGB_LED_PIN, NEO_GRB + NEO_KHZ800);
bool readTemperature(float &tempC, float &tempF);
bool readHttpBodyAfterHeaders(Client& client, bool chunked, int contentLength,
                              String& outBody, unsigned long deadlineMs);
bool discordIdLooksValid(const String& id);
bool httpsConnect(const char* host, uint32_t timeoutMs = 15000);
uint8_t httpsGetOpen(const char* host, const String& path, unsigned long headerTimeoutMs,
                     const char* userAgent = "MiniMeBot/1.0",
                     const char* extraHeaders = nullptr);
uint8_t httpGetOpen(WiFiClient& client, const char* host, const String& path, unsigned long headerTimeoutMs);
bool httpsAwaitHeaders(unsigned long deadlineMs, bool pump, String& outStatus,
                       bool& chunked, int& contentLength);
void setHttpOpenError(String& outReport, uint8_t err, const char* label);
void boardMemTotals(uint32_t& memFree, uint32_t& memTotal);
void uptimeDhms(unsigned long& days, unsigned long& hours, unsigned long& minutes);
void pumpGateway();
void noteDisplayActivity() {
  lastDisplayActivityMillis = millis();
  if (displayAsleep) {
    displayAsleep = false;
    u8g2.setPowerSave(0);
    lastDashMillis = 0;
  }
  u8g2.setContrast(DISPLAY_CONTRAST_FULL);
}
bool touchSampleValid(uint32_t raw) {
  return raw > 0 && raw < 150000;
}
uint32_t touchTripPoint() {
  return touchIdleAvg + TOUCH_THRESHOLD;
}
uint32_t readUsbVbusMilliVolts() {
  unsigned long now = millis();
  if (usbVbusLastReadMs != 0 && (now - usbVbusLastReadMs) < USB_VBUS_READ_MS) {
    return usbVbusMvCached;
  }
  usbVbusLastReadMs = now;
  uint32_t pinMv = analogReadMilliVolts((uint8_t)PIN_USB_VBUS_ADC);
  uint32_t inst = (uint32_t)((uint64_t)pinMv * (USB_VBUS_R_HI + USB_VBUS_R_LO) / USB_VBUS_R_LO);
  if (usbVbusMvCached == 0) usbVbusMvCached = inst;
  else usbVbusMvCached = (usbVbusMvCached * 7u + inst) / 8u;
  return usbVbusMvCached;
}
void rescaleTouchIdleForVbus(uint32_t oldV, uint32_t newV) {
  if (oldV == 0 || newV == 0 || touchIdleBufCount == 0) return;
  touchIdleSum = 0;
  for (uint8_t i = 0; i < touchIdleBufCount; i++) {
    touchIdleBuf[i] = (uint32_t)((uint64_t)touchIdleBuf[i] * oldV / newV);
    touchIdleSum += touchIdleBuf[i];
  }
  touchIdleAvg = touchIdleSum / touchIdleBufCount;
}
uint32_t compensateTouchRaw(uint32_t raw) {
  uint32_t v = readUsbVbusMilliVolts();
  if (usbVbusRefMv < 1000 || v < 1000) return raw;
  if (usbVbusCompLastMv >= 1000 && usbVbusCompLastMv != v) {
    rescaleTouchIdleForVbus(usbVbusCompLastMv, v);
  }
  usbVbusCompLastMv = v;
  return (uint32_t)((uint64_t)raw * usbVbusRefMv / v);
}
void setupUsbVbusAdc() {
  analogSetPinAttenuation(PIN_USB_VBUS_ADC, ADC_11db);
  pinMode(PIN_USB_VBUS_ADC, INPUT);
  uint32_t acc = 0;
  for (int i = 0; i < 8; i++) {
    usbVbusLastReadMs = 0;
    acc += readUsbVbusMilliVolts();
    delay(10);
  }
  usbVbusRefMv = acc / 8;
  usbVbusCompLastMv = usbVbusMvCached;
}
void touchIdlePush(uint32_t sample) {
  if (touchIdleBufCount < TOUCH_AVG_N) {
    touchIdleBuf[touchIdleBufCount++] = sample;
    touchIdleSum += sample;
  } else {
    touchIdleSum -= touchIdleBuf[touchIdleBufIdx];
    touchIdleBuf[touchIdleBufIdx] = sample;
    touchIdleSum += sample;
    touchIdleBufIdx = (uint8_t)((touchIdleBufIdx + 1) % TOUCH_AVG_N);
  }
  if (touchIdleBufCount > 0) touchIdleAvg = touchIdleSum / touchIdleBufCount;
}
void calibrateTouchIdleAvg() {
  touchIdleBufCount = 0;
  touchIdleBufIdx = 0;
  touchIdleSum = 0;
  touchIdleAvg = 0;
  for (int i = 0; i < TOUCH_AVG_N; i++) {
    uint32_t raw = (uint32_t)touchRead(PIN_TOUCH);
    if (touchSampleValid(raw)) touchIdlePush(compensateTouchRaw(raw));
    delay(25);
  }
  if (touchIdleBufCount == 0) {
    uint32_t raw = (uint32_t)touchRead(PIN_TOUCH);
    touchIdlePush(compensateTouchRaw(raw));
  }
}
void updateTouchIdleAvg(uint32_t compensated) {
  if (!touchSampleValid(compensated)) return;
  if (compensated >= touchTripPoint()) return;
  touchIdlePush(compensated);
}
void configureTouchHardware() {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
  touchSetTiming(0.5f, 100);
#else
  touchSetCycles(1, 100);
#endif
}
void setupTouch() {
  setupUsbVbusAdc();
  configureTouchHardware();
  calibrateTouchIdleAvg();
}
bool touchIsActive() {
  uint32_t raw = (uint32_t)touchRead(PIN_TOUCH);
  uint32_t compensated = compensateTouchRaw(raw);
  if (compensated >= touchTripPoint()) return true;
  updateTouchIdleAvg(compensated);
  return false;
}
void pollTouchWake() {
  bool active = touchIsActive();
  if (!active) {
    touchWasActive = false;
    return;
  }
  unsigned long now = millis();
  if (now - lastTouchWakeMillis < TOUCH_DEBOUNCE_MS) return;
  if (touchWasActive) return;
  touchWasActive = true;
  lastTouchWakeMillis = now;
  noteDisplayActivity();
}
void updateDisplaySleep() {
  if (displayAsleep) return;
  unsigned long now = millis();
  if (lastDisplayActivityMillis == 0) {
    lastDisplayActivityMillis = now;
    return;
  }
  unsigned long idle = now - lastDisplayActivityMillis;
  if (idle < DISPLAY_IDLE_MS) return;
  if (idle < DISPLAY_IDLE_MS + DISPLAY_DIM_MS) {
    unsigned long dimElapsed = idle - DISPLAY_IDLE_MS;
    uint8_t contrast = (uint8_t)(DISPLAY_CONTRAST_FULL -
      (dimElapsed * (unsigned long)DISPLAY_CONTRAST_FULL) / DISPLAY_DIM_MS);
    u8g2.setContrast(contrast);
    return;
  }
  displayAsleep = true;
  u8g2.setPowerSave(1);
}
void showTransient(const String& line1, const String& line2 = "", const String& line3 = "", unsigned long durationMs = 3000) {
  noteDisplayActivity();
  transientLine1 = line1;
  transientLine2 = line2;
  transientLine3 = line3;
  transientUntilMs = millis() + durationMs;
  lastDashMillis = 0;
}
void drawDashBar(const char* label, uint8_t baselineY, int fillW) {
  u8g2.drawStr(0, baselineY, label);
  u8g2.drawFrame(25, baselineY - 7, 103, 8);
  if (fillW > 0) u8g2.drawBox(26, baselineY - 6, fillW, 6);
}
void drawDashboard() {
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_5x7_tf);
  updateLocalTime();
  String t = timeClient.getFormattedTime();
  u8g2.drawStr(0, 7, "MiniMe");
  u8g2.drawStr(42, 7, gatewayConnected ? "GW:Good" : "GW:Bad");
  int timeX = 128 - u8g2.getStrWidth(t.c_str());
  if (timeX < 0) timeX = 0;
  u8g2.drawStr(timeX, 7, t.c_str());
  {
    static const char* const DOW_NAME[] = {"Sun","Mon","Tue","Wed","Thu","Fri","Sat"};
    static const char* const MON_NAME[] = {"Jan","Feb","Mar","Apr","May","Jun",
                                           "Jul","Aug","Sep","Oct","Nov","Dec"};
    time_t localEpoch = (time_t)timeClient.getEpochTime();
    struct tm tmLocal;
    gmtime_r(&localEpoch, &tmLocal);
    char botBuf[12];
    snprintf(botBuf, sizeof(botBuf), "Bot:%-6s",
             (botDiscordStatus == 2) ? "Online" : "Idle");
    u8g2.drawStr(0, 15, botBuf);
    char dateBuf[20];
    snprintf(dateBuf, sizeof(dateBuf), "%s %s %2d %04d",
             DOW_NAME[tmLocal.tm_wday], MON_NAME[tmLocal.tm_mon],
             tmLocal.tm_mday, tmLocal.tm_year + 1900);
    const char* dateSlot = "Www Mmm 99 9999";
    int dateX = 128 - u8g2.getStrWidth(dateSlot);
    if (dateX < 0) dateX = 0;
    u8g2.drawStr(dateX, 15, dateBuf);
  }
  unsigned long d = 0, h = 0, m = 0;
  uptimeDhms(d, h, m);
  char upTempBuf[32];
  if (dashTempC > -998.0f) {
    snprintf(upTempBuf, sizeof(upTempBuf), "Up:%4lud%2luh%2lum T:%3.0fF/%3.0fC",
             d, h, m, dashTempF, dashTempC);
  } else {
    snprintf(upTempBuf, sizeof(upTempBuf), "Up:%4lud%2luh%2lum T:--Error--", d, h, m);
  }
  u8g2.drawStr(0, 23, upTempBuf);
  long rssi = WiFi.RSSI();
  uint32_t memFree = 0, memTotal = 0;
  boardMemTotals(memFree, memTotal);
  int sigBarW = 0;
  if (rssi >= -40) sigBarW = 79;
  else if (rssi <= -100) sigBarW = 0;
  else sigBarW = (int)((rssi + 100) * 79 / 60);
  drawDashBar("Sig:", 31, sigBarW);
  int heapBarW = 0;
  if (memTotal > 0) {
    heapBarW = (int)((memFree * 79UL) / memTotal);
    if (heapBarW < 0) heapBarW = 0;
    if (heapBarW > 79) heapBarW = 79;
  }
  drawDashBar("Heap:", 39, heapBarW);
  const int srvInnerW = 101;
  int srvBarW = (lastServoDeg * srvInnerW) / 90;
  if (srvBarW < 0) srvBarW = 0;
  if (srvBarW > srvInnerW) srvBarW = srvInnerW;
  drawDashBar("Srv:", 47, srvBarW);
  const int gapPx = 4;
  const int statusW = u8g2.getStrWidth("Idle");
  const int botReserveW = u8g2.getStrWidth("Bot:999");
  int nameMaxPx = 128 - gapPx - statusW - gapPx - botReserveW;
  if (nameMaxPx < 16) nameMaxPx = 16;
  const char* nameSrc[MAX_TRACKED_USERS];
  int longestNamePx = 0;
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (!trackedUsers[i].active) {
      nameSrc[i] = "---";
    } else if (trackedUsers[i].userName.length()) {
      nameSrc[i] = trackedUsers[i].userName.c_str();
    } else {
      nameSrc[i] = trackedUsers[i].userId.c_str();
    }
    int w = u8g2.getStrWidth(nameSrc[i]);
    if (w > longestNamePx) longestNamePx = w;
  }
  if (longestNamePx > nameMaxPx) longestNamePx = nameMaxPx;
  int statusX = longestNamePx + gapPx;
  for (uint8_t row = 0; row < MAX_TRACKED_USERS; row++) {
    uint8_t y = 55 + (row * 8);
    char name[40];
    strncpy(name, nameSrc[row], sizeof(name) - 1);
    name[sizeof(name) - 1] = '\0';
    while (strlen(name) > 1 && u8g2.getStrWidth(name) > longestNamePx) {
      name[strlen(name) - 1] = '\0';
    }
    u8g2.drawStr(0, y, name);
    u8g2.drawStr(statusX, y,
                 statusToWord(trackedUsers[row].active ? trackedUsers[row].status : 0));
    uint32_t uses = trackedUsers[row].active ? trackedUsers[row].useCount24h : 0;
    char botBuf[12];
    snprintf(botBuf, sizeof(botBuf), "Bot:%lu", (unsigned long)uses);
    int botX = 128 - u8g2.getStrWidth(botBuf);
    if (botX < statusX + statusW + 2) botX = statusX + statusW + 2;
    u8g2.drawStr(botX, y, botBuf);
  }
  String row15 = "";
  String row16 = "";
  if (millis() < transientUntilMs) {
    row15 = transientLine1;
    row16 = transientLine2;
    if (transientLine3.length()) {
      if (row16.length()) row16 += " ";
      row16 += transientLine3;
    }
  }
  u8g2.drawStr(0, 119, row15.c_str());
  u8g2.drawStr(0, 127, row16.c_str());
  u8g2.sendBuffer();
}
void updateDisplay() {
  updateDisplaySleep();
  if (displayAsleep) return;
  unsigned long now = millis();
  if (transientUntilMs != 0 && now >= transientUntilMs) {
    transientUntilMs = 0;
    lastDashMillis = 0;
  }
  if (lastDashMillis == 0 || now - lastDashMillis >= DASH_REFRESH_MS) {
    lastDashMillis = now;
    float c, f;
    if (readTemperature(c, f)) {
      dashTempC = c;
      dashTempF = f;
    }
    drawDashboard();
  }
}
void setupServo() {
  ledc_timer_config_t timer = {
    .speed_mode       = LEDC_LOW_SPEED_MODE,
    .duty_resolution  = LEDC_TIMER_14_BIT,
    .timer_num        = LEDC_TIMER_0,
    .freq_hz          = 50,
    .clk_cfg          = LEDC_AUTO_CLK
  };
  ledc_timer_config(&timer);
  ledc_channel_config_t channel = {
    .gpio_num         = PIN_SERVO,
    .speed_mode       = LEDC_LOW_SPEED_MODE,
    .channel          = LEDC_CHANNEL_0,
    .intr_type        = LEDC_INTR_DISABLE,
    .timer_sel        = LEDC_TIMER_0,
    .duty             = 0,
    .hpoint           = 0
  };
  ledc_channel_config(&channel);
}
void setServoAngle(int angleDeg) {
  if (angleDeg < 0) angleDeg = 0;
  if (angleDeg > 90) angleDeg = 90;
  lastServoDeg = angleDeg;
  int pulseUs = 500 + (1500 * angleDeg / 90);
  uint32_t max_duty = (1 << 14) - 1;
  uint32_t duty = (pulseUs * max_duty) / 20000;
  ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0, duty);
  ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0);
}
void setupPins() {
  pinMode(RGB_LED_PIN, OUTPUT);
  digitalWrite(RGB_LED_PIN, LOW);
  pixels.begin();
  pixels.show();
  pinMode(PIN_SET1, OUTPUT);
  pinMode(PIN_SET2, OUTPUT);
  digitalWrite(PIN_SET1, LOW);
  digitalWrite(PIN_SET2, LOW);
  pinMode(PIN_DS18B20, INPUT_PULLUP);
  setupServo();
  setServoAngle(45);
}
bool readTemperature(float &tempC, float &tempF) {
  pinMode(PIN_DS18B20, INPUT_PULLUP);
  sensors.requestTemperatures();
  float c = sensors.getTempCByIndex(0);
  if (c == DEVICE_DISCONNECTED_C) {
    return false;
  }
  tempC = c;
  tempF = c * 9.0f / 5.0f + 32.0f;
  return true;
}
void boardMemTotals(uint32_t& memFree, uint32_t& memTotal) {
  uint32_t psramSize = ESP.getPsramSize();
  uint32_t psramFree = ESP.getFreePsram();
  if (psramSize < BOARD_PSRAM_BYTES) psramSize = BOARD_PSRAM_BYTES;
  if (ESP.getPsramSize() == 0 || psramFree < 1) psramFree = BOARD_PSRAM_BYTES;
  memTotal = ESP.getHeapSize() + psramSize;
  memFree = ESP.getFreeHeap() + psramFree;
}
void uptimeDhms(unsigned long& days, unsigned long& hours, unsigned long& minutes) {
  unsigned long sec = millis() / 1000;
  days = sec / 86400;
  hours = (sec % 86400) / 3600;
  minutes = (sec % 3600) / 60;
  if (days > 9999) days = 9999;
}
String getSystemInfo() {
  long rssi = WiFi.RSSI();
  uint32_t freeHeap = 0, totalHeap = 0;
  boardMemTotals(freeHeap, totalHeap);
  unsigned long days = 0, hours = 0, minutes = 0;
  uptimeDhms(days, hours, minutes);
  String uptimeStr = String(days) + "d " + String(hours) + "h " + String(minutes) + "m";
  return "📊 **System Diagnostics:**\n"
         "• **Uptime:** " + uptimeStr + "\n"
         "• **Free Heap:** " + String((unsigned long)freeHeap) + " / " +
         String((unsigned long)totalHeap) + " bytes\n"
         "• **WiFi RSSI:** " + String(rssi) + " dBm\n"
         "• **Gateway Status:** " + String((gatewayConnected && identified) ? "Connected" : "Disconnected") + "\n"
         "• **USB VBUS:** " + String((float)readUsbVbusMilliVolts() / 1000.0f, 3) + " V\n"
         "• **Firmware:** https://github.com/dogma2u/A-discord-bot-on-ESP32";
}
bool httpsInUse = false;
bool sendDiscordMessage(const String& channelId, const String& content, bool suppressEmbeds = false) {
  if (httpsInUse) return false;
  String post = content;
  if (post.length() > DISCORD_CONTENT_MAX) post = post.substring(0, DISCORD_CONTENT_MAX - 3) + "...";
  httpsInUse = true;
  if (!httpsConnect("discord.com")) {
    httpsInUse = false;
    return false;
  }
  String url = "/api/v10/channels/" + channelId + "/messages";
  StaticJsonDocument<4096> doc;
  doc["content"] = post;
  doc["tts"] = false;
  if (suppressEmbeds) doc["flags"] = 4;
  if (post.length() > 0 && doc["content"].isNull()) {
    httpsClient.stop();
    httpsInUse = false;
    return false;
  }
  String body;
  serializeJson(doc, body);
  String request =
    "POST " + url + " HTTP/1.1\r\n"
    "Host: discord.com\r\n"
    "Authorization: Bot " + String(BOT_TOKEN) + "\r\n"
