dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
void sendFetchResult(const String& channelId, const char* label, bool ok, const String& report,
                     const String& okLine2 = "Sent", const String& okLine3 = "") {
  sendDiscordMessage(channelId, report);
  if (ok) showTransient(label, okLine2, okLine3);
  else showTransient(label, "Error");
}
void runFetchCommand(const String& channelId, const char* label, const char* fetching,
                     FetchReportFn fetch) {
  String report;
  showTransient(label, fetching);
  sendFetchResult(channelId, label, fetch(report), report);
}
void handleCommand(const String& content, const String& authorId, const String& authorName,
                   const String& channelId, bool isDM)
{
  if (!isDM && channelId != TARGET_CHANNEL_ID && channelId != TARGET_CHANNEL_ID1) {
    return;
  }
  String raw = content;
  raw.trim();
  bool midLine = false;
  if (!raw.startsWith("!")) {
    int bang = -1;
    for (int i = 0; i < raw.length(); i++) {
      if (raw.charAt(i) != '!') continue;
      char next = (i + 1 < raw.length()) ? raw.charAt(i + 1) : 0;
      if (!((next >= 'a' && next <= 'z') || (next >= 'A' && next <= 'Z'))) continue;
      if (i > 0) {
        char prev = raw.charAt(i - 1);
        if (prev != ' ' && prev != '\t' && prev != '\n') continue;
      }
      bang = i;
      break;
    }
    if (bang < 0) return;
    raw = raw.substring(bang);
    midLine = true;
  }
  noteBotActivity();
  int spIdx = raw.indexOf(' ');
  String cmdWord = (spIdx > 0) ? raw.substring(0, spIdx) : raw;
  String args = (spIdx > 0) ? raw.substring(spIdx + 1) : "";
  cmdWord.toLowerCase();
  args.trim();
  if (midLine && args.length() > 0 &&
      cmdWord != "!ask" && cmdWord != "!display" && cmdWord != "!led") {
    int argSp = args.indexOf(' ');
    if (argSp > 0) args = args.substring(0, argSp);
    while (args.length() > 0) {
      char last = args.charAt(args.length() - 1);
      if (last == '.' || last == ',' || last == '!' || last == '?' || last == ';' || last == ':') {
        args.remove(args.length() - 1);
      } else {
        break;
      }
    }
  }
  recordUserUse(authorId, authorName);
  if (cmdWord == "!help") {
    String helpMsg =
      "🤖 **MiniMe Bot Commands**\n\n"
      "**👤 Public Commands:**\n"
      "• `!apod` — NASA Astronomy Picture of the Day.\n"
      "• `!ask <question>` — Asks DeepSeek (text AI reply in chat).\n"
      "• `!display <text>` — Writes custom text to the OLED screen.\n"
      "• `!help` — Shows this command list.\n"
      "• `!iss` — Current International Space Station position.\n"
      "• `!news` — Space and high-tech science headlines.\n"
      "• `!physics` — Latest arXiv physics papers.\n"
      "• `!sysinfo` — Displays system diagnostics (uptime, heap, RSSI, etc.).\n"
      "• `!temp` — Reads the current indoor temperature sensor.\n"
      "• `!time` — Displays the current bot time.\n"
      "• `!weather <zip>` — Fetches the weather report for a US ZIP code.\n\n"
      "**👑 Owner-Only Commands:**\n"
      "• `!led on/off` / `!led <r> <g> <b>` — RGB NeoPixel (0–255 per channel).\n"
      "• `!servo <0-90>` — Moves the servo motor to a specific angle.\n"
      "• `!set1 on` / `!set1 off` — Controls digital output pin 1.\n"
      "• `!set2 on` / `!set2 off` — Controls digital output pin 2.";
    sendDiscordMessage(channelId, helpMsg);
    showTransient("Help", "Command Sent");
    return;
  }
  if (cmdWord == "!weather") {
    if (args.length() == 0) {
      sendDiscordMessage(channelId, "Usage: !weather <zip>");
      return;
    }
    String zip = args;
    bool validZip = (zip.length() == 5);
    if (validZip) {
      for (unsigned i = 0; i < 5; i++) {
        char c = zip.charAt(i);
        if (c < '0' || c > '9') { validZip = false; break; }
      }
    }
    if (!validZip) {
      sendDiscordMessage(channelId, "Invalid ZIP code.");
      return;
    }
    String report;
    showTransient("Weather", "Fetching " + zip + "...");
    bool ok = getWeather(zip, report);
    sendFetchResult(channelId, "Weather", ok, report, zip, "Sent");
    return;
  }
  if (cmdWord == "!news") {
    runFetchCommand(channelId, "News", "Fetching...", getScienceNews);
    return;
  }
  if (cmdWord == "!physics") {
    runFetchCommand(channelId, "Physics", "Fetching arXiv...", getPhysicsPapers);
    return;
  }
  if (cmdWord == "!apod") {
    runFetchCommand(channelId, "APOD", "Fetching NASA...", getApod);
    return;
  }
  if (cmdWord == "!iss") {
    runFetchCommand(channelId, "ISS", "Fetching...", getIssPosition);
    return;
  }
  if (cmdWord == "!temp") {
    float c, f;
    if (readTemperature(c, f)) {
      dashTempC = c;
      dashTempF = f;
      String msg = "Current Temp: " + String(c, 1) + "°C / " + String(f, 1) + "°F";
      sendDiscordMessage(channelId, msg);
      showTransient("Temp", String(f, 1) + "F/" + String(c, 1) + "C");
    } else {
      sendDiscordMessage(channelId, "Temperature sensor error.");
      showTransient("Temp", "Sensor error");
    }
    return;
  }
  if (cmdWord == "!sysinfo") {
    sendDiscordMessage(channelId, getSystemInfo(), true);
    showTransient("SysInfo", "Sent");
    return;
  }
  if (cmdWord == "!time") {
    updateLocalTime();
    String currentTime = timeClient.getFormattedTime();
    String msg = "🕒 Current Bot Time: " + currentTime;
    sendDiscordMessage(channelId, msg);
    showTransient("Time", currentTime);
    return;
  }
  if (cmdWord == "!ask") {
    if (args.length() == 0) {
      sendDiscordMessage(channelId, "Usage: !ask <question>");
      return;
    }
    if (askNeedPost) {
      sendDiscordMessage(channelId, "DeepSeek is already answering. Try again in a moment.");
      return;
    }
    String question = args;
    askPendingQuestion = question;
    askPendingChannelId = channelId;
    askNeedPost = true;
    showTransient("DeepSeek", "Queued");
    return;
  }
  if (cmdWord == "!display") {
    if (args.length() == 0) {
      sendDiscordMessage(channelId, "Usage: !display <text>");
      return;
    }
    String text = args;
    if (text.length() > 50) text = text.substring(0, 50);
    String line15 = text.substring(0, text.length() > 25 ? 25 : text.length());
    String line16 = text.length() > 25 ? text.substring(25) : "";
    showTransient(line15, line16, "", 6000);
    sendDiscordMessage(channelId, "Display updated.");
    return;
  }
  int setN = 0;
  if (cmdWord.length() == 5 && cmdWord.startsWith("!set")) {
    char d = cmdWord.charAt(4);
    if (d == '1' || d == '2') setN = d - '0';
  }
  if (cmdWord == "!led" || setN != 0 || cmdWord == "!servo") {
    if (!isOwner(authorId)) {
      if (!isDM) {
        sendDiscordMessage(channelId, "You are not allowed to use this command.");
      }
      return;
    }
    if (cmdWord == "!led") {
      String a = args;
      a.trim();
      String al = a;
      al.toLowerCase();
      if (al == "on") {
        setLedRgb(255, 255, 255);
        sendDiscordMessage(channelId, "LED ON (255 255 255)");
        showTransient("LED", "ON");
      } else if (al == "off") {
        setLedRgb(0, 0, 0);
        sendDiscordMessage(channelId, "LED OFF");
        showTransient("LED", "OFF");
      } else {
        uint8_t r, g, b;
        if (!parseRgbTriplet(a, r, g, b)) {
          sendDiscordMessage(channelId, "Usage: !led on/off  or  !led <r> <g> <b> (0-255)");
          return;
        }
        setLedRgb(r, g, b);
        String msg = "LED RGB " + String(r) + " " + String(g) + " " + String(b);
        sendDiscordMessage(channelId, msg);
        showTransient("LED", String(r) + "," + String(g) + "," + String(b));
      }
      return;
    }
    if (setN != 0) {
      String a = args;
      a.toLowerCase();
      int pin = (setN == 1) ? PIN_SET1 : PIN_SET2;
      if (a != "on" && a != "off") {
        sendDiscordMessage(channelId, "Usage: !set1 on/off  or  !set2 on/off");
        return;
      }
      bool on = (a == "on");
      digitalWrite(pin, on ? HIGH : LOW);
      String label = "set" + String(setN);
      String val = on ? "ON" : "OFF";
      sendDiscordMessage(channelId, label + " " + val);
      showTransient(label, val);
      return;
    }
    if (cmdWord == "!servo") {
      if (args.length() == 0) {
        sendDiscordMessage(channelId, "Usage: !servo <0-90>");
        return;
      }
      int angle = args.toInt();
      if (angle < 0 || angle > 90) {
        sendDiscordMessage(channelId, "Angle out of range. Allowed: 0-90 degrees.");
        return;
      }
      setServoAngle(angle);
      String msg = "Servo set to " + String(angle) + " degrees.";
      sendDiscordMessage(channelId, msg);
      showTransient("Servo", String(angle) + " deg");
      return;
    }
  }
  sendDiscordMessage(channelId, "That is not a command.");
  showTransient("Unknown", cmdWord);
}
void gatewayEvent(WStype_t type, uint8_t * payload, size_t length) {
  switch (type) {
    case WStype_DISCONNECTED:
      gatewayConnected = false;
      identified       = false;
      botDiscordStatus = 0;
      showTransient("Gateway", "Disconnected");
      break;
    case WStype_CONNECTED:
      gatewayConnected = true;
      showTransient("Gateway", "Connected");
      break;
    case WStype_TEXT: {
      static StaticJsonDocument<384> gwFilter;
      static bool gwFilterInit = false;
      if (!gwFilterInit) {
        gwFilter["op"] = true;
        gwFilter["s"] = true;
        gwFilter["t"] = true;
        gwFilter["d"]["heartbeat_interval"] = true;
        gwFilter["d"]["status"] = true;
        gwFilter["d"]["user"]["id"] = true;
        gwFilter["d"]["user"]["username"] = true;
        gwFilter["d"]["user"]["global_name"] = true;
        gwFilter["d"]["content"] = true;
        gwFilter["d"]["channel_id"] = true;
        gwFilter["d"]["guild_id"] = true;
        gwFilter["d"]["author"]["id"] = true;
        gwFilter["d"]["author"]["username"] = true;
        gwFilter["d"]["author"]["global_name"] = true;
        gwFilter["d"]["author"]["bot"] = true;
        gwFilter["d"]["presences"][0]["user"]["id"] = true;
        gwFilter["d"]["presences"][0]["status"] = true;
        gwFilter["d"]["guilds"][0]["presences"][0]["user"]["id"] = true;
        gwFilter["d"]["guilds"][0]["presences"][0]["status"] = true;
        gwFilterInit = true;
      }
      if (!gwDoc) return;
      gwDoc->clear();
      DeserializationError err = deserializeJson(*gwDoc, payload, length, DeserializationOption::Filter(gwFilter));
      if (err) return;
      int op = (*gwDoc)["op"] | -1;
      if (gwDoc->containsKey("s") && !(*gwDoc)["s"].isNull()) {
        lastSeq = (*gwDoc)["s"].as<int>();
      }
      if (op == 10) {
        heartbeatIntervalMs = (*gwDoc)["d"]["heartbeat_interval"] | 0;
        lastHeartbeatMillis = millis();
        sendIdentify();
        identified = true;
        return;
      }
      if (op == 11) return;
      if (op == 0) {
        const char* t = (*gwDoc)["t"];
        if (!t) return;
        if (strcmp(t, "READY") == 0) {
          JsonArray guilds = (*gwDoc)["d"]["guilds"].as<JsonArray>();
          if (!guilds.isNull()) {
            for (JsonObject g : guilds) {
              applyPresencesArray(g["presences"].as<JsonArray>());
            }
          }
          requestTrackedUserPresences();
          return;
        }
        if (strcmp(t, "GUILD_CREATE") == 0) {
          applyPresencesArray((*gwDoc)["d"]["presences"].as<JsonArray>());
          requestTrackedUserPresences();
          return;
        }
        if (strcmp(t, "GUILD_MEMBERS_CHUNK") == 0) {
          applyPresencesArray((*gwDoc)["d"]["presences"].as<JsonArray>());
          return;
        }
        if (strcmp(t, "PRESENCE_UPDATE") == 0) {
          handlePresenceUpdate((*gwDoc)["d"]);
          return;
        }
        if (strcmp(t, "MESSAGE_CREATE") == 0) {
          if (httpsInUse) return;
          JsonObject d = (*gwDoc)["d"];
          if (d["author"]["bot"] == true) return;
          String content   = d["content"].as<String>();
          String channelId = d["channel_id"].as<String>();
          String authorId  = d["author"]["id"].as<String>();
          String authorName = discordDisplayName(d["author"]);
          bool isDM = d["guild_id"].isNull();
          handleCommand(content, authorId, authorName, channelId, isDM);
        }
      }
      break;
    }
    default:
      break;
  }
}
void backgroundTasks() {
  runAskFromLoop();
  unsigned long now = millis();
  if (gatewayConnected && identified &&
      (lastSysInfoMillis == 0 || now - lastSysInfoMillis >= SYSINFO_INTERVAL_MS)) {
    lastSysInfoMillis = now;
    noteBotActivity();
    sendDiscordMessage(TARGET_CHANNEL_ID, getSystemInfo(), true);
  }
  updateLocalTime();
  int currentHour = timeClient.getHours();
  int currentMinute = timeClient.getMinutes();
  if ((currentHour == 6 || currentHour == 12 || currentHour == 18) && currentMinute == 0) {
    if (lastSentHour != currentHour) {
      lastSentHour = currentHour;
      float c, f;
      noteBotActivity();
      if (readTemperature(c, f)) {
        String report = "⏰ **Scheduled Summary (" + String(currentHour) + ":00):**\n" +
                        "• **Indoor Temp:** " + String(c, 1) + "°C / " + String(f, 1) + "°F";
        sendDiscordMessage(TARGET_CHANNEL_ID, report);
        showTransient("Scheduled", "Report Sent");
      } else {
        sendDiscordMessage(TARGET_CHANNEL_ID, "⏰ **Scheduled Summary:** Temperature sensor error.");
      }
    }
  } else {
    if (lastSentHour != -1 && currentHour != 6 && currentHour != 12 && currentHour != 18) {
      lastSentHour = -1;
    }
  }
}
void connectWiFi() {
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  showTransient("WiFi", "Connecting...");
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
  }
  showTransient("WiFi", "Connected");
}
void connectGateway() {
  gatewayWS.beginSSL("gateway.discord.gg", 443, "/?v=10&encoding=json");
  gatewayWS.onEvent(gatewayEvent);
  gatewayWS.setReconnectInterval(5000);
}
void setup() {
  delay(500);
  gwDoc = new DynamicJsonDocument(GW_DOC_PSRAM);
  initTrackedUsers();
  Wire.begin(PIN_I2C_SDA, PIN_I2C_SCL);
  u8g2.begin();
  u8g2.setContrast(DISPLAY_CONTRAST_FULL);
  lastDisplayActivityMillis = millis();
  showTransient("Booting...", "ESP32-S3 Discord bot");
  setupPins();
  sensors.begin();
  connectWiFi();
  timeClient.begin();
  showTransient("Discord", "Loading users...");
  if (fetchGuildMembersAtStartup()) {
    String n0 = trackedUsers[0].userName.length() ? trackedUsers[0].userName : "ok";
    showTransient("Users loaded", n0);
  } else {
    showTransient("Users", "Fetch failed");
  }
  delay(1200);
  connectGateway();
  setServoAngle(45);
  lastDashMillis = 0;
  setupTouch();
  showTransient("Ready", "Idle presence");
  drawDashboard();
}
void loop() {
  pumpGateway();
  backgroundTasks();
  pollTouchWake();
  updateBotPresenceIdle();
  updateDisplay();
  applyCpuForIdleState();
  delay(5);
}
